loadTesting/artillery_get_questions.yml
config:
  target: 'http://192.168.1.7:8080'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 100
      name: Ramp up load
    - duration: 300
      arrivalRate: 200
      name: Sustained load
  payload:
    # Load search keywords from an external CSV file and make them available
    # to virtual user scenarios as variable "keywords":
    path: 'products.csv'
    fields:
      - 'product'
scenarios:
  # We define one scenario:
  - name: 'Get Questions in a Product'
    flow:
      - post:
          url: '/graphql'
          json: { 'query': '{getQuestions(product_id: {{product}}){_id}}' }